#!/usr/bin/python
# -*- coding: utf-8 -*-

def Toolsbander():
    BANNER = """\033[32m
    ==========================================================================================
    ||                                                                                      ||
    ||                                                                                      ||
    ||  ██       ██                  ████████                                               ||                     
    || ░██      ░██  █████  ██████  ██░░░░░░                                       █████    ||
    || ░██   █  ░██ ██░░░██░██░░░██░██         █████   █████       ██████  ██████ ██░░░██   ||
    || ░██  ███ ░██░██  ░██░██  ░██░█████████ ██░░░██ ██░░░██     ██░░░░██░░██░░█░██  ░██   ||
    || ░██ ██░██░██░░██████░██████ ░░░░░░░░██░███████░██  ░░     ░██   ░██ ░██ ░ ░░██████   ||
    || ░████ ░░████ ░░░░░██░██░░░         ░██░██░░░░ ░██   ██    ░██   ░██ ░██    ░░░░░██   ||
    || ░██░   ░░░██  █████ ░██      ████████ ░░██████░░█████  ░██ ░░██████ ░███     █████   ||
    || ░░       ░░  ░░░░░  ░░      ░░░░░░░░   ░░░░░░  ░░░░░   ░░  ░░░░░░  ░░░     ░░░░░     ||
    ||                                                                                      ||
    ||                                From www.WgpSec.org                                   ||
    ||                                集成信息收集工具 V1.0                                 ||
    ==========================================================================================
    \033[5m
    """
    print(BANNER)
    print('\033[33m[Warring] 使用须知\033[0m\n'
          '\033[36m[1st]\033[0m 第一次检测工具的时候,在已知的工具包显示后,会生成一个TOOLS文件夹，在里面存放的是需要使用的工具\n\n'
          '\033[36m[2rd]\033[0m 工具的作用是日常中收集信息的方式,从域名着手依次为：\n      域名-->IP(站长之家)-->敏感目录(Dirmap)-->子域名(OneForAll)-->C段(Masscan)-->端口(Masscan+nmap)\n      \n'
          '\033[36m[3th]\033[0m 支持IP反查，这里面有一个CDN的判断，非常鸡肋，我目前只把几个服务器厂商的地址放进去了\n'
          '      实际效果不理想，因为CDN确实太难顶了，所以我把C段扫描单独放出来，可以自主选择是否需要C段\n\n'
          '\033[36m[4th]\033[0m 因为一些工具的原因，当前工具只能在LIUNX主机上使用\n')
    return '\033[36m[4th]\033[0m SUCCESS!\n'

print(Toolsbander())